[
  {
    "question": "How does an airplane stay in the air?",
    "response": "Airplanes stay in the air through a combination of four key forces: lift, weight, thrust, and drag. The wings are specially shaped (curved on top, flatter on bottom) to create lift - as air flows faster over the curved top surface, it creates lower pressure above the wing compared to below, pushing the plane upward. The engines provide thrust to move forward, while the plane's weight pulls it down and air resistance creates drag. When lift exceeds weight and thrust overcomes drag, the plane flies!",
    "images": [
      "Diagram showing the four forces acting on an airplane: lift (upward arrow from wings), weight (downward arrow from center), thrust (forward arrow from engines), and drag (backward arrow)",
      "Cross-section view of an airplane wing showing how air flows faster over the curved top surface, creating low pressure above and high pressure below",
      "Illustration of an airplane in flight with colored arrows indicating airflow patterns around the wings and fuselage"
    ]
  },
  {
    "question": "How does Wi-Fi actually work?",
    "response": "Wi-Fi works by converting data into radio waves and transmitting them through the air! Your router receives internet data through a cable, then converts it into radio waves using an antenna. These waves travel through the air at specific frequencies (usually 2.4GHz or 5GHz). Your device has a Wi-Fi adapter that receives these radio waves and converts them back into data. It's like an invisible highway of information floating all around you! The router constantly sends and receives these signals, allowing multiple devices to connect and communicate simultaneously.",
    "images": [
      "Simple diagram of a Wi-Fi router sending radio waves (shown as curved lines) to a laptop, smartphone, and tablet",
      "Visualization of radio wave frequencies showing the difference between 2.4GHz and 5GHz bands with wave patterns",
      "Cross-section view of a home with Wi-Fi signal strength zones shown in different colors from router to various rooms"
    ]
  },
  {
    "question": "Why is the sky blue?",
    "response": "The sky appears blue because of how sunlight interacts with Earth's atmosphere! Sunlight looks white, but it's actually made up of all colors of the rainbow. As sunlight enters our atmosphere, it collides with tiny gas molecules. Blue light has a shorter wavelength and gets scattered in all directions much more than other colors (a process called Rayleigh scattering). This scattered blue light comes at our eyes from all parts of the sky, making it appear blue. At sunset, sunlight travels through more atmosphere, scattering away most blue light, which is why we see reds and oranges!",
    "images": [
      "Diagram showing white sunlight entering Earth's atmosphere and blue light scattering in all directions while other colors pass through more directly",
      "Illustration of light wavelengths with blue having shorter waves and red having longer waves",
      "Visual comparison of daytime blue sky versus sunset/sunrise with orange-red colors, showing the path of light through atmosphere"
    ]
  },
  {
    "question": "How to remove coffee stains from clothes?",
    "response": "To remove coffee stains, act fast! First, blot (don't rub) the stain with a clean cloth to absorb excess coffee. Rinse the back of the stain with cold water to push the coffee out. Mix one tablespoon of liquid dish soap, one tablespoon of white vinegar, and two cups of warm water. Apply this solution to the stain with a clean cloth, blotting from the outside in. Rinse with cold water. If the stain persists, apply a stain remover or rub with liquid laundry detergent, then wash as usual. For old stains, soak in cold water mixed with enzyme laundry detergent for 30 minutes before washing.",
    "images": [
      "Step 1: Hand blotting fresh coffee spill on white shirt with paper towel",
      "Step 2: Mixing solution of dish soap, vinegar and water in a bowl with measuring spoons nearby",
      "Step 3: Applying solution to stain with cloth, showing blotting motion from outside to center",
      "Before and after comparison showing coffee-stained shirt versus clean shirt after treatment"
    ]
  },
  {
    "question": "How does solar power become electricity?",
    "response": "Solar panels convert sunlight directly into electricity through the photovoltaic effect! Each panel is made of many solar cells containing silicon (a semiconductor). When sunlight hits the cell, photons (light particles) knock electrons loose from the silicon atoms. The cell has an electric field that pushes these freed electrons in one direction, creating an electrical current. This produces DC (direct current) electricity, which then flows to an inverter that converts it to AC (alternating current) electricity that your home can use. It's like millions of tiny batteries all working together when exposed to light!",
    "images": [
      "Diagram of a solar cell showing sunlight photons hitting silicon atoms and freeing electrons",
      "Illustration of a complete solar power system: panels on roof, wires to inverter, inverter converting DC to AC, connection to home electrical panel",
      "Close-up cross-section of solar panel layers showing silicon cells, protective glass, and backing materials"
    ]
  }
]

